Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
/****************************************************************************
 * apps/examples/camera_diag/esp32p4_dsi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * L1.8.25f display-link Stage 1: EK79007 MIPI-DSI panel solid-color / color
 * bar diagnostic (NuttX). Mirrors the official ESP-IDF stack
 * (esp_lcd_mipi_dsi_bus.c + esp_lcd_panel_dpi.c + esp_lcd_ek79007.c) but
 * calls the esp-hal-3rdparty HAL/LL directly (no esp_lcd object layer):
 *
 *   1. MIPI PHY LDO (chan 3, 2.5 V) - same as the CSI path
 *   2. mipi_dsi_ll_enable_bus_clock + reset_register (bus 0)
 *   3. PHY PLL config clocks + mipi_dsi_hal_init + configure_phy_pll
 *   4. DSI host generic-interface config (CRC/ECC/EoTp/timeout/escape div)
 *   5. EK79007 init command table over the DBI (generic) channel
 *   6. DPI panel config: host DPI timing/color-coding + bridge config
 *      (RGB565 in/out, flow ctrl = DMA, burst 256, empty thresh 768)
 *   7. Solid color / color bar drawn into a PSRAM frame buffer
 *   8. DW-GDMA channel (MEM -> DSI bridge, flow ctrl SELF) keeps
 *      refreshing the panel; hold for a fixed window, then teardown.
 *
 * RESTRICTED diagnostic: no image capture/save/analysis, no network, no
 * camera involvement. Panel output is observed visually on the LCD only.
 *
 * Returned Value:
 *   OK (0) on success; negative errno on failure.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include <nuttx/arch.h>   /* up_udelay */
#include <nuttx/irq.h>

#include "irq.h"        /* DW_GDMA_INTR_SOURCE / ESP_SOURCE2IRQ */
#include "esp_irq.h"    /* esp_setup_irq / esp_teardown_irq */

#include "soc/soc.h"
#include "soc/reg_base.h"

#include "hal/mipi_dsi_hal.h"
#include "hal/mipi_dsi_ll.h"
#include "hal/mipi_dsi_host_ll.h"
#include "hal/mipi_dsi_brg_ll.h"
#include "hal/mipi_dsi_phy_ll.h"
#include "hal/mipi_dsi_periph.h"
#include "hal/dw_gdma_ll.h"

#include "esp_ldo_regulator.h"
#include "esp_cache.h"
#include "esp_heap_caps.h"
#include "esp_rom_gpio.h"
#include "soc/gpio_reg.h"
#include "esp_private/esp_clk_tree_common.h"
#include "esp32p4_dsi.h"

/* DSI host default timeout/escape clock frequencies (official bus.c) */
#define DSI_DEFAULT_TIMEOUT_CLOCK_FREQ_MHZ  10
#define DSI_DEFAULT_ESCAPE_CLOCK_FREQ_MHZ   18

/* __DECLARE_RCC_ATOMIC_ENV shim: expands to the variable name callers
 * declare before using the clock-gate ll wrappers (build-level). */
#define __DECLARE_RCC_ATOMIC_ENV rcc_atomic_env

/* ------------------------------------------------------------------------
 * Panel / DSI configuration (official EK79007 defaults)
 * ---------------------------------------------------------------------- */

#define DSI_BUS_ID           0
#define DSI_NUM_LANES        2
#define DSI_LANE_MBPS        1000.0f

#define PANEL_H_RES          1024
#define PANEL_V_RES          600
#define PANEL_BPP            16                /* RGB565 */

#define DPI_CLK_SRC_MHZ      240.0f            /* P4 DPI default src = PLL_F240M (240 MHz) */
#define DPI_CLK_MHZ          48.0f

#define IMG_HSYNC            10
#define IMG_HBP              120
#define IMG_HFP              120
#define IMG_VSYNC            1
#define IMG_VBP              20
#define IMG_VFP              10

#define DSI_BRG_BURST_LEN    256
#define DSI_BRG_EMPTY_THRESH (1024 - 256)

#define DSI_GDMA_CHANNEL     1                 /* ch0 = CSI, ch1 = DSI */

#define DSI_PIN_LCD_RST      27
#define DSI_PIN_BK_LIGHT     26
#define DSI_TOUCH_RADIUS     55
#define DSI_TOUCH_DIAMETER   (2 * DSI_TOUCH_RADIUS + 1)

/* ------------------------------------------------------------------------
 * EK79007 init command table (official esp_lcd_ek79007 vendor_specific_init)
 * ---------------------------------------------------------------------- */

struct ek79007_init_cmd_s
{
  uint8_t cmd;
  const uint8_t *data;
  uint8_t data_bytes;
  uint8_t delay_ms;
};

#define EK79007_PAD_CONTROL  0xB2
#define EK79007_DSI_2_LANE   0x10

static const uint8_t d0 = 0x8B;
static const uint8_t d1 = 0x78;
static const uint8_t d2 = 0x84;
static const uint8_t d3 = 0x88;
static const uint8_t d4 = 0xA8;
static const uint8_t d5 = 0xE3;

static const struct ek79007_init_cmd_s s_ek79007_init_cmds[] =
{
  {0x80, &d0, 1, 0},
  {0x81, &d1, 1, 0},
  {0x82, &d2, 1, 0},
  {0x83, &d3, 1, 0},
  {0x84, &d4, 1, 0},
  {0x85, &d5, 1, 0},
  {0x86, &d3, 1, 0},          /* 0x86: 0x88 (official EK79007 default) */
  {0x11, NULL, 0, 120},       /* Sleep Out, 120 ms */
};

/* ------------------------------------------------------------------------
 * Static state
 * ---------------------------------------------------------------------- */

static mipi_dsi_hal_context_t s_dsi_hal;
static dw_gdma_dev_t *g_dsi_dma_dev;
static esp_ldo_channel_handle_t g_dsi_ldo;
static bool g_dsi_ldo_acquired;
static FAR uint8_t *g_dsi_status_ui_fb;
static bool g_dsi_status_ui_active;
static int g_dsi_inference_result_count = -1;
static int g_dsi_inference_energy_level = -1;
static bool g_dsi_label_detected;
static int g_dsi_workflow_stage;
static esp32p4_dsi_workflow_cb_t g_dsi_workflow_cb;
static bool g_dsi_workflow_blocked;
int esp32p4_dsi_status_ui_set_inspection_result(int candidate_count,
                                                int energy_level);
void esp32p4_dsi_status_ui_stop(void);
static bool g_dsi_touch_has_point;
static uint16_t g_dsi_touch_x;
static uint16_t g_dsi_touch_y;
static int g_dsi_touch_x0;
static int g_dsi_touch_y0;
static int g_dsi_touch_width;
static int g_dsi_touch_height;
static uint16_t g_dsi_touch_backup[DSI_TOUCH_DIAMETER * DSI_TOUCH_DIAMETER];

/* L1.8.25f display Stage 2 prep: the DW-GDMA controller is shared with the
 * CSI path (ch0 = CSI, ch1 = DSI). dw_gdma_ll_reset() is a CONTROLLER-level
 * soft reset (reset0.dmac_rst) that clears ALL channels, so we must not
 * re-run it once the controller is up. g_dsi_gdma_controller_init guards
 * the controller-level init; per-channel config below is safe to redo. */
static bool g_dsi_gdma_controller_init;

static void dsi_board_gpio_prepare(void)
{
  esp_rom_gpio_pad_select_gpio(DSI_PIN_LCD_RST);
  esp_rom_gpio_pad_select_gpio(DSI_PIN_BK_LIGHT);
  esp_rom_gpio_connect_out_signal(DSI_PIN_LCD_RST, 0x100, false, false);
  esp_rom_gpio_connect_out_signal(DSI_PIN_BK_LIGHT, 0x100, false, false);
  REG_SET_BIT(GPIO_ENABLE_W1TS_REG, (1u << DSI_PIN_LCD_RST) |
              (1u << DSI_PIN_BK_LIGHT));
  REG_SET_BIT(GPIO_OUT_W1TC_REG, (1u << DSI_PIN_BK_LIGHT));
}

static void dsi_board_panel_reset(void)
{
  REG_SET_BIT(GPIO_OUT_W1TC_REG, (1u << DSI_PIN_LCD_RST));
  up_mdelay(10);
  REG_SET_BIT(GPIO_OUT_W1TS_REG, (1u << DSI_PIN_LCD_RST));
  up_mdelay(20);
}

static void dsi_board_backlight_enable(void)
{
  REG_SET_BIT(GPIO_OUT_W1TS_REG, (1u << DSI_PIN_BK_LIGHT));
}

static void dsi_panel_io_config(void)
{
  dsi_host_dev_t *host = s_dsi_hal.host;

  mipi_dsi_host_ll_enable_te_ack(host, false);
  mipi_dsi_host_ll_enable_cmd_ack(host, true);
  mipi_dsi_host_ll_set_gen_short_wr_speed_mode(
      host, 0, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_short_wr_speed_mode(
      host, 1, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_short_wr_speed_mode(
      host, 2, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_long_wr_speed_mode(
      host, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_short_rd_speed_mode(
      host, 0, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_short_rd_speed_mode(
      host, 1, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_gen_short_rd_speed_mode(
      host, 2, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_dcs_short_wr_speed_mode(
      host, 0, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_dcs_short_wr_speed_mode(
      host, 1, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_dcs_long_wr_speed_mode(
      host, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_dcs_short_rd_speed_mode(
      host, 0, MIPI_DSI_LL_TRANS_SPEED_LP);
  mipi_dsi_host_ll_set_mrps_speed_mode(host, MIPI_DSI_LL_TRANS_SPEED_LP);
}

/* ------------------------------------------------------------------------
 * DSI bus init (mirrors esp_lcd_new_dsi_bus)
 * ---------------------------------------------------------------------- */

static int dsi_bus_init(void)
{
  mipi_dsi_hal_config_t hal_cfg;
  int rcc_atomic_env;

  /* APB clock + reset for DSI host/bridge registers */
  mipi_dsi_ll_enable_bus_clock(DSI_BUS_ID, true);
  mipi_dsi_ll_reset_register(DSI_BUS_ID);

  /* PHY PLL reference clock: P4 default = XTAL 40 MHz (MIPI_DSI_PHY_PLLREF
   * _CLK_SRC_DEFAULT = SOC_MOD_CLK_XTAL). Enable the source gate first
   * (official esp_lcd_new_dsi_bus does esp_clk_tree_enable_src). */
  esp_clk_tree_enable_src((soc_module_clk_t)MIPI_DSI_PHY_PLLREF_CLK_SRC_DEFAULT, true);
  mipi_dsi_ll_set_phy_pllref_clock_source(DSI_BUS_ID,
                                          MIPI_DSI_PHY_PLLREF_CLK_SRC_DEFAULT);
  mipi_dsi_ll_set_phy_pll_ref_clock_div(DSI_BUS_ID, 1);
  mipi_dsi_ll_enable_phy_pllref_clock(DSI_BUS_ID, true);

  /* PHY config clock (PLL_F20M) - enable source gate as well */
  esp_clk_tree_enable_src((soc_module_clk_t)MIPI_DSI_PHY_CFG_CLK_SRC_DEFAULT, true);
  mipi_dsi_ll_set_phy_config_clock_source(DSI_BUS_ID,
                                          MIPI_DSI_PHY_CFG_CLK_SRC_DEFAULT);
  mipi_dsi_ll_enable_phy_config_clock(DSI_BUS_ID, true);

  memset(&hal_cfg, 0, sizeof(hal_cfg));
  hal_cfg.bus_id           = DSI_BUS_ID;
  hal_cfg.lane_bit_rate_mbps = DSI_LANE_MBPS;
  hal_cfg.num_data_lanes   = DSI_NUM_LANES;

  mipi_dsi_hal_init(&s_dsi_hal, &hal_cfg);
  mipi_dsi_hal_configure_phy_pll(&s_dsi_hal, 40u * 1000u * 1000u,
                                 DSI_LANE_MBPS);

  /* Wait for PHY PLL lock and lanes stopped (official bus init) */
  {
    int lock_wait = 0;

    while (!mipi_dsi_phy_ll_is_pll_locked(s_dsi_hal.host))
      {
        up_udelay(1000);
        if (++lock_wait > 100)
          {
            printf("dsi: PHY PLL lock timeout\n");
            return -ETIMEDOUT;
          }
      }

    printf("dsi: PHY PLL locked\n");
  }

  {
    int lane_wait = 0;

    while (!mipi_dsi_phy_ll_are_lanes_stopped(s_dsi_hal.host, DSI_NUM_LANES))
      {
        up_udelay(1000);
        if (++lane_wait > 100)
          {
            printf("dsi: lane stop timeout\n");
            return -ETIMEDOUT;
          }
      }

    printf("dsi: lanes stopped\n");
  }

  /* Host generic-interface config */
  mipi_dsi_host_ll_enable_video_mode(s_dsi_hal.host, false);
  mipi_dsi_host_ll_set_clock_lane_state(s_dsi_hal.host,
                                        MIPI_DSI_LL_CLOCK_LANE_STATE_AUTO);
  mipi_dsi_phy_ll_set_switch_time(s_dsi_hal.host, 50, 104, 46, 128);
  mipi_dsi_host_ll_enable_rx_crc(s_dsi_hal.host, true);
  mipi_dsi_host_ll_enable_rx_ecc(s_dsi_hal.host, true);
  mipi_dsi_host_ll_enable_tx_eotp(s_dsi_hal.host, true, false);
  mipi_dsi_host_ll_set_timeout_clock_division(
      s_dsi_hal.host,
      (uint32_t)(DSI_LANE_MBPS / 8.0f /
                 DSI_DEFAULT_TIMEOUT_CLOCK_FREQ_MHZ + 0.5f));
  mipi_dsi_host_ll_set_escape_clock_division(
      s_dsi_hal.host,
      (uint32_t)(DSI_LANE_MBPS / 8.0f /
                 DSI_DEFAULT_ESCAPE_CLOCK_FREQ_MHZ + 0.5f));
  mipi_dsi_host_ll_set_timeout_count(s_dsi_hal.host, 0, 0, 0, 0, 0, 0, 0);
  mipi_dsi_phy_ll_set_max_read_time(s_dsi_hal.host, 6000);
  mipi_dsi_phy_ll_set_stop_wait_time(s_dsi_hal.host, 0x3f);

  return OK;
}

/* ------------------------------------------------------------------------
 * EK79007 panel init (mirrors panel_ek79007_send_init_cmds)
 * ---------------------------------------------------------------------- */

static void dsi_panel_send_init_cmds(void)
{
  int i;
  uint8_t lane_cmd = EK79007_DSI_2_LANE;

  /* Software reset (mirrors panel_ek79007_reset when no hardware RST pin):
   * 0x01 SWRESET + 20 ms, required before the vendor init sequence. */
  mipi_dsi_hal_host_gen_write_dcs_command(&s_dsi_hal, 0, 0x01, 1, NULL, 0);
  up_mdelay(20);

  /* PAD_CONTROL: 2-lane DSI */
  mipi_dsi_hal_host_gen_write_dcs_command(&s_dsi_hal, 0,
                                          EK79007_PAD_CONTROL, 1,
                                          &lane_cmd, 1);

  for (i = 0; i < (int)(sizeof(s_ek79007_init_cmds) /
                        sizeof(s_ek79007_init_cmds[0])); i++)
    {
      if (s_ek79007_init_cmds[i].data_bytes > 0)
        {
          mipi_dsi_hal_host_gen_write_dcs_command(
              &s_dsi_hal, 0,
              s_ek79007_init_cmds[i].cmd, 1,
              s_ek79007_init_cmds[i].data,
              s_ek79007_init_cmds[i].data_bytes);
        }
      else
        {
          mipi_dsi_hal_host_gen_write_dcs_command(
              &s_dsi_hal, 0,
              s_ek79007_init_cmds[i].cmd, 1,
              NULL, 0);
        }

      if (s_ek79007_init_cmds[i].delay_ms > 0)
        {
          up_mdelay(s_ek79007_init_cmds[i].delay_ms);
        }
    }

  printf("dsi: ek79007 init cmds sent (%d cmds)\n",
         (int)(sizeof(s_ek79007_init_cmds) / sizeof(s_ek79007_init_cmds[0])));
}

/* ------------------------------------------------------------------------
 * DPI panel config (mirrors esp_lcd_new_panel_dpi + dpi_panel_init)
 * ---------------------------------------------------------------------- */

