Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
static void dsi_dpi_config(void)
{
  uint32_t dpi_div;
  uint32_t num_pixel_bits;
  uint32_t fb_bytes;
  int rcc_atomic_env;

  fb_bytes = PANEL_H_RES * PANEL_V_RES * PANEL_BPP / 8;

  dsi_board_gpio_prepare();
  num_pixel_bits = PANEL_H_RES * PANEL_V_RES * PANEL_BPP;

  /* DPI clock: default source PLL_F240M (240 MHz) -> divide to 48 MHz.
   * The PLL output gate must be enabled first (official esp_lcd_new_panel_dpi
   * calls esp_clk_tree_enable_src(dpi_clk_src, true)); without it the DPI
   * clock does not run and the panel stays black. */
  esp_clk_tree_enable_src((soc_module_clk_t)MIPI_DSI_DPI_CLK_SRC_DEFAULT, true);
  mipi_dsi_ll_set_dpi_clock_source(DSI_BUS_ID, MIPI_DSI_DPI_CLK_SRC_DEFAULT);
  dpi_div = mipi_dsi_hal_host_dpi_calculate_divider(&s_dsi_hal,
                                                    DPI_CLK_SRC_MHZ,
                                                    DPI_CLK_MHZ);
  mipi_dsi_ll_set_dpi_clock_div(DSI_BUS_ID, dpi_div);
  mipi_dsi_ll_enable_dpi_clock(DSI_BUS_ID, true);

  /* Host DPI: vcid, color coding, timing polarity, LP transitions */
  mipi_dsi_host_ll_dpi_set_vcid(s_dsi_hal.host, 0);
  mipi_dsi_host_ll_dpi_set_color_coding(s_dsi_hal.host,
                                        LCD_COLOR_FMT_RGB565, 0);
  mipi_dsi_host_ll_dpi_set_timing_polarity(s_dsi_hal.host,
                                           false, false, false, false, false);

  /* allow LP in all video periods and for commands */
  mipi_dsi_host_ll_dpi_enable_lp_horizontal_timing(s_dsi_hal.host,
                                                   true, true);
  mipi_dsi_host_ll_dpi_enable_lp_vertical_timing(s_dsi_hal.host,
                                                 true, true, true, true);
  mipi_dsi_host_ll_dpi_enable_lp_command(s_dsi_hal.host, true);

  mipi_dsi_host_ll_dpi_enable_frame_ack(s_dsi_hal.host, true);
  mipi_dsi_host_ll_dpi_set_video_burst_type(
      s_dsi_hal.host, MIPI_DSI_LL_VIDEO_BURST_WITH_SYNC_PULSES);
  mipi_dsi_host_ll_dpi_set_video_packet_pixel_num(s_dsi_hal.host,
                                                  PANEL_H_RES);
  mipi_dsi_host_ll_dpi_set_trunks_num(s_dsi_hal.host, 0);
  mipi_dsi_host_ll_dpi_set_null_packet_size(s_dsi_hal.host, 0);

  mipi_dsi_hal_host_dpi_set_horizontal_timing(&s_dsi_hal,
                                              IMG_HSYNC, IMG_HBP,
                                              PANEL_H_RES, IMG_HFP);
  mipi_dsi_hal_host_dpi_set_vertical_timing(&s_dsi_hal,
                                            IMG_VSYNC, IMG_VBP,
                                            PANEL_V_RES, IMG_VFP);

  /* Bridge config */
  mipi_dsi_brg_ll_set_num_pixel_bits(s_dsi_hal.bridge, num_pixel_bits);
  mipi_dsi_brg_ll_set_underrun_discard_count(s_dsi_hal.bridge, PANEL_H_RES);
  mipi_dsi_brg_ll_set_input_color_format(s_dsi_hal.bridge,
                                         LCD_COLOR_FMT_RGB565);
  mipi_dsi_brg_ll_set_output_color_format(s_dsi_hal.bridge,
                                          LCD_COLOR_FMT_RGB565, 0);
  mipi_dsi_brg_ll_set_flow_controller(s_dsi_hal.bridge,
                                      MIPI_DSI_LL_FLOW_CONTROLLER_DMA);
  mipi_dsi_brg_ll_set_multi_block_number(s_dsi_hal.bridge, 1);
  mipi_dsi_brg_ll_set_burst_len(s_dsi_hal.bridge, DSI_BRG_BURST_LEN);
  mipi_dsi_brg_ll_set_empty_threshold(s_dsi_hal.bridge,
                                      DSI_BRG_EMPTY_THRESH);
  mipi_dsi_brg_ll_enable(s_dsi_hal.bridge, true);
  mipi_dsi_brg_ll_update_dpi_config(s_dsi_hal.bridge);

  printf("dsi: dpi config done (dpi_div=%lu fb_bytes=%lu)\n",
         (unsigned long)dpi_div, (unsigned long)fb_bytes);
}

/* Read-only snapshot for panels which accept the command sequence and
 * backlight but remain black.  The active registers show whether the host
 * latched the DPI timing; PHY status and host status distinguish a link-side
 * failure from a panel-side timing or format mismatch. */
static void dsi_host_phy_dump(FAR const char *tag)
{
  dsi_host_dev_t *host = s_dsi_hal.host;

  printf("dsi: host@%s pwr=0x%08lx mode=0x%08lx vid=0x%08lx pkt=0x%08lx "
         "hsa=0x%08lx hbp=0x%08lx hline=0x%08lx vsa=0x%08lx "
         "vbp=0x%08lx vfp=0x%08lx vact=0x%08lx\n",
         tag, (unsigned long)host->pwr_up.val,
         (unsigned long)host->mode_cfg.val,
         (unsigned long)host->vid_mode_cfg.val,
         (unsigned long)host->vid_pkt_size.val,
         (unsigned long)host->vid_hsa_time.val,
         (unsigned long)host->vid_hbp_time.val,
         (unsigned long)host->vid_hline_time.val,
         (unsigned long)host->vid_vsa_lines.val,
         (unsigned long)host->vid_vbp_lines.val,
         (unsigned long)host->vid_vfp_lines.val,
         (unsigned long)host->vid_vactive_lines.val);

  printf("dsi: host@%s active_vid=0x%08lx active_pkt=0x%08lx "
         "active_hline=0x%08lx active_vact=0x%08lx phy_rstz=0x%08lx "
         "phy_if=0x%08lx phy_status=0x%08lx lpclk=0x%08lx\n",
         tag, (unsigned long)host->vid_mode_cfg_act.val,
         (unsigned long)host->vid_pkt_size_act.val,
         (unsigned long)host->vid_hline_time_act.val,
         (unsigned long)host->vid_vactive_lines_act.val,
         (unsigned long)host->phy_rstz.val,
         (unsigned long)host->phy_if_cfg.val,
         (unsigned long)host->phy_status.val,
         (unsigned long)host->lpclk_ctrl.val);

  printf("dsi: host@%s int0=0x%08lx int1=0x%08lx mask0=0x%08lx "
         "mask1=0x%08lx\n",
         tag, (unsigned long)host->int_st0.val,
         (unsigned long)host->int_st1.val,
         (unsigned long)host->int_msk0.val,
         (unsigned long)host->int_msk1.val);
}

/* ------------------------------------------------------------------------
 * DW-GDMA channel for MEM -> DSI bridge (flow ctrl SELF).
 *
 * The official DPI driver uses one valid, last LLI and re-arms it from its
 * DMA-complete ISR. A self-referential LLI is not valid on this DW-GDMA and
 * raises SHADOWREG_OR_LLI_INVALID_ERR after the first frame.
 * ---------------------------------------------------------------------- */

static dw_gdma_link_list_item_t *g_dsi_lli;
static volatile bool g_dsi_gdma_armed;
static bool g_dsi_gdma_isr_attached;
static int g_dsi_gdma_cpuint = -1;
static bool g_dsi_gdma_shared_irq;

static void dsi_gdma_dump_lli(void)
{
  FAR volatile uint32_t *lli_nc;
  intptr_t current;

  if (g_dsi_dma_dev == NULL || g_dsi_lli == NULL)
    {
      return;
    }

  lli_nc = (FAR volatile uint32_t *)((uintptr_t)g_dsi_lli +
                                     SOC_NON_CACHEABLE_OFFSET_SRAM);
  current = dw_gdma_ll_channel_get_current_link_list_item_addr(
    g_dsi_dma_dev, DSI_GDMA_CHANNEL);

  printf("dsi: lli head=%p current=0x%08lx w0=%08lx w1=%08lx w2=%08lx "
         "w3=%08lx w4=%08lx w5=%08lx w6=%08lx w7=%08lx\n",
         g_dsi_lli, (unsigned long)current,
         (unsigned long)lli_nc[0], (unsigned long)lli_nc[1],
         (unsigned long)lli_nc[2], (unsigned long)lli_nc[3],
         (unsigned long)lli_nc[4], (unsigned long)lli_nc[5],
         (unsigned long)lli_nc[6], (unsigned long)lli_nc[7]);
  printf("dsi: lli w8=%08lx w9=%08lx w10=%08lx w11=%08lx w12=%08lx "
         "w13=%08lx w14=%08lx w15=%08lx\n",
         (unsigned long)lli_nc[8], (unsigned long)lli_nc[9],
         (unsigned long)lli_nc[10], (unsigned long)lli_nc[11],
         (unsigned long)lli_nc[12], (unsigned long)lli_nc[13],
         (unsigned long)lli_nc[14], (unsigned long)lli_nc[15]);
}

void esp32p4_dsi_gdma_irq_handler(void)
{
  dw_gdma_dev_t *dev = g_dsi_dma_dev;
  uint32_t st;

  if (dev == NULL)
    {
      return;
    }

  st = dw_gdma_ll_channel_get_intr_status(dev, DSI_GDMA_CHANNEL);
  dw_gdma_ll_channel_clear_intr(dev, DSI_GDMA_CHANNEL, st);

  /* Debug: track ISR calls */
  static int isr_count = 0;
  isr_count++;
  if (isr_count <= 5 || isr_count % 100 == 0)
    {
      printf("dsi: ISR called #%d st=0x%08lx armed=%d lli=%p\n",
             isr_count, (unsigned long)st, (int)g_dsi_gdma_armed, g_dsi_lli);
    }

  if ((st & DW_GDMA_LL_CHANNEL_EVENT_DMA_TFR_DONE) != 0 &&
      g_dsi_gdma_armed && g_dsi_lli != NULL)
    {
      FAR dw_gdma_link_list_item_t *lli_nc =
        (FAR dw_gdma_link_list_item_t *)((uintptr_t)g_dsi_lli +
                                         SOC_NON_CACHEABLE_OFFSET_SRAM);

      /* The terminal item is consumed by hardware. Revalidate it before
       * reloading, exactly as esp_lcd_panel_dpi does in its completion ISR. */
      dw_gdma_ll_lli_set_block_markers(lli_nc, false, true, true);
      dw_gdma_ll_channel_set_link_list_head_addr(
        dev, DSI_GDMA_CHANNEL, (uint32_t)(uintptr_t)g_dsi_lli);
      dw_gdma_ll_channel_set_link_list_master_port(
        dev, DSI_GDMA_CHANNEL, DW_GDMA_LL_MASTER_PORT_MEMORY);
      dw_gdma_ll_channel_enable(dev, DSI_GDMA_CHANNEL, true);

      if (isr_count <= 5)
        {
          printf("dsi: ISR re-armed DMA\n");
        }
    }

