Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
}

static int dsi_gdma_done_isr(int irq, FAR void *arg, FAR void *context)
{
  esp32p4_dsi_gdma_irq_handler();
  return 0;
}

static int dsi_gdma_install_done_isr(void)
{
  dw_gdma_dev_t *dev = g_dsi_dma_dev;
  int ret;

  if (dev == NULL)
    {
      return -EINVAL;
    }

  if (g_dsi_gdma_isr_attached)
    {
      return OK;
    }

  /* Keep non-completion events out of the CLIC and clear any residue before
   * routing the DMA source. This mirrors the proven CSI R4-D2 lifecycle. */
  dw_gdma_ll_channel_enable_intr_propagation(dev, DSI_GDMA_CHANNEL,
                                             0xffffffffu, false);
  dw_gdma_ll_channel_clear_intr(dev, DSI_GDMA_CHANNEL, 0xffffffffu);
  dw_gdma_ll_channel_enable_intr_generation(
    dev, DSI_GDMA_CHANNEL, DW_GDMA_LL_CHANNEL_EVENT_DMA_TFR_DONE, true);
  dw_gdma_ll_channel_enable_intr_propagation(
    dev, DSI_GDMA_CHANNEL, DW_GDMA_LL_CHANNEL_EVENT_DMA_TFR_DONE, true);

  ret = esp_setup_irq(DW_GDMA_INTR_SOURCE, ESP_IRQ_PRIORITY_DEFAULT,
                      ESP_IRQ_TRIGGER_LEVEL, dsi_gdma_done_isr, NULL);
  if (ret < 0)
    {
      return -EIO;
    }

  g_dsi_gdma_cpuint = ret;
  up_enable_irq(ESP_SOURCE2IRQ(DW_GDMA_INTR_SOURCE));
  g_dsi_gdma_isr_attached = true;
  return OK;
}

static void dsi_gdma_uninstall_done_isr(void)
{
  dw_gdma_dev_t *dev = g_dsi_dma_dev;

  g_dsi_gdma_armed = false;

  if (dev != NULL)
    {
      dw_gdma_ll_channel_enable_intr_propagation(dev, DSI_GDMA_CHANNEL,
                                                 0xffffffffu, false);
      dw_gdma_ll_channel_clear_intr(dev, DSI_GDMA_CHANNEL, 0xffffffffu);
    }

  /* The live preview shares the source route installed by CSI.  It owns
   * channel 1's mask/status only; never tear down CSI's cpuint mapping. */
  if (g_dsi_gdma_isr_attached && !g_dsi_gdma_shared_irq)
    {
      esp_teardown_irq(DW_GDMA_INTR_SOURCE, g_dsi_gdma_cpuint);
      g_dsi_gdma_isr_attached = false;
      g_dsi_gdma_cpuint = -1;
    }
}

static int dsi_gdma_start(FAR uint8_t *fb, uint32_t fb_bytes)
{
  dw_gdma_dev_t *dev = g_dsi_dma_dev;
  uint8_t ch = DSI_GDMA_CHANNEL;
  uint32_t items = fb_bytes / 8;   /* 64-bit transfer items */
  dw_gdma_link_list_item_t *lli;
  dw_gdma_link_list_item_t *lli_nc;   /* non-cacheable alias for LLI writes */
  int rcc_atomic_env;
  int ret;

  if (dev == NULL)
    {
      return -EINVAL;
    }

  /* Reset + enable controller ONCE (shared with CSI; a controller-level
   * reset would wipe the CSI channel too). Stage 2 flows call this after
   * the CSI path has already brought the DMAC up, so we only initialize
   * the controller here when it has not been done before. */
  if (!g_dsi_gdma_controller_init)
    {
      dw_gdma_ll_enable_bus_clock(0, true);
      dw_gdma_ll_reset_register(0);
      dw_gdma_ll_reset(dev);
      dw_gdma_ll_enable_controller(dev, true);
      dw_gdma_ll_enable_intr_global(dev, true);
      g_dsi_gdma_controller_init = true;
    }

  /* Channel: MEM(src, increment) -> DSI bridge(dst, fixed), LIST mode */
  dw_gdma_ll_channel_set_trans_flow(dev, ch,
                                    DW_GDMA_ROLE_MEM,
                                    DW_GDMA_ROLE_PERIPH_DSI,
                                    DW_GDMA_FLOW_CTRL_SELF);
  dw_gdma_ll_channel_set_src_handshake_interface(dev, ch,
                                                 DW_GDMA_HANDSHAKE_HW);
  dw_gdma_ll_channel_set_dst_handshake_interface(dev, ch,
                                                 DW_GDMA_HANDSHAKE_HW);
  dw_gdma_ll_channel_set_dst_handshake_periph(dev, ch,
                                              DW_GDMA_ROLE_PERIPH_DSI);

  dw_gdma_ll_channel_set_src_burst_mode(dev, ch, DW_GDMA_BURST_MODE_INCREMENT);
  dw_gdma_ll_channel_set_src_burst_items(dev, ch, DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_src_burst_len(dev, ch, 16);
  dw_gdma_ll_channel_set_src_trans_width(dev, ch, DW_GDMA_TRANS_WIDTH_64);

  dw_gdma_ll_channel_set_dst_burst_mode(dev, ch, DW_GDMA_BURST_MODE_FIXED);
  dw_gdma_ll_channel_set_dst_burst_items(dev, ch, DW_GDMA_BURST_ITEMS_256);
  dw_gdma_ll_channel_set_dst_burst_len(dev, ch, 16);
  dw_gdma_ll_channel_set_dst_trans_width(dev, ch, DW_GDMA_TRANS_WIDTH_64);

  /* Linked-list based multi-block (one terminal item). */
  dw_gdma_ll_channel_set_src_multi_block_type(dev, ch,
                                              DW_GDMA_BLOCK_TRANSFER_LIST);
  dw_gdma_ll_channel_set_dst_multi_block_type(dev, ch,
                                              DW_GDMA_BLOCK_TRANSFER_LIST);
  dw_gdma_ll_channel_set_src_outstanding_limit(dev, ch, 5);
  dw_gdma_ll_channel_set_dst_outstanding_limit(dev, ch, 2);
  dw_gdma_ll_channel_set_priority(dev, ch, 1);

  /* Single terminal LLI item: fb -> DSI bridge. */
  lli = (dw_gdma_link_list_item_t *)
    heap_caps_aligned_alloc(DW_GDMA_LL_LINK_LIST_ALIGNMENT,
                            sizeof(dw_gdma_link_list_item_t),
                            MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
  if (lli == NULL)
    {
      printf("dsi: lli alloc failed\n");
      return -ENOMEM;
    }

  /* R4-D3: write the LLI through its non-cacheable alias, after a one-shot
   * cache sync, exactly like esp-idf dw_gdma_new_link_list. Writing via the
   * cached alias without msync left the fields in L2 cache while the DMA
   * engine read stale memory -> SHADOWREG_OR_LLI_INVALID_ERR (gdma_intr
   * bit13) and gdma_tr stayed 0. The descriptor and head use cached
   * addresses, as required by the DMA link-list engine. */
  esp_cache_msync(lli, sizeof(*lli),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_INVALIDATE |
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  lli_nc = (dw_gdma_link_list_item_t *)
    ((uintptr_t)lli + SOC_NON_CACHEABLE_OFFSET_SRAM);
  memset(lli_nc, 0, sizeof(*lli));
  dw_gdma_ll_lli_set_src_addr(lli_nc, (uint32_t)(uintptr_t)fb);
  dw_gdma_ll_lli_set_dst_addr(lli_nc, MIPI_DSI_BRG_MEM_BASE);
  dw_gdma_ll_lli_set_trans_block_size(lli_nc, items);
  dw_gdma_ll_lli_set_src_master_port(lli_nc, (intptr_t)fb);
  dw_gdma_ll_lli_set_dst_master_port(lli_nc, MIPI_DSI_BRG_MEM_BASE);
  dw_gdma_ll_lli_set_src_trans_width(lli_nc, DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_lli_set_dst_trans_width(lli_nc, DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_lli_set_src_burst_mode(lli_nc, DW_GDMA_BURST_MODE_INCREMENT);
  dw_gdma_ll_lli_set_dst_burst_mode(lli_nc, DW_GDMA_BURST_MODE_FIXED);
  dw_gdma_ll_lli_set_src_burst_items(lli_nc, DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_lli_set_dst_burst_items(lli_nc, DW_GDMA_BURST_ITEMS_256);
  dw_gdma_ll_lli_set_src_burst_len(lli_nc, 16);
  dw_gdma_ll_lli_set_dst_burst_len(lli_nc, 16);
  dw_gdma_ll_lli_set_link_list_master_port(lli_nc,
                                           DW_GDMA_LL_MASTER_PORT_MEMORY);
  dw_gdma_ll_lli_set_next_item_addr(lli_nc, 0);
  dw_gdma_ll_lli_set_block_markers(lli_nc, false, true, true);

