Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
  printf("dsi: gdma_start shared_irq=%d isr_attached=%d\n",
         (int)g_dsi_gdma_shared_irq, (int)g_dsi_gdma_isr_attached);

  if (g_dsi_gdma_shared_irq)
    {
      /* CSI owns DW_GDMA_INTR_SOURCE in the live session.  Configure only
       * channel 1's completion event; do not replace CSI's demux handler. */
      dw_gdma_ll_channel_enable_intr_propagation(dev, ch, 0xffffffffu, false);
      dw_gdma_ll_channel_clear_intr(dev, ch, 0xffffffffu);
      dw_gdma_ll_channel_enable_intr_generation(
        dev, ch, DW_GDMA_LL_CHANNEL_EVENT_DMA_TFR_DONE, true);
      dw_gdma_ll_channel_enable_intr_propagation(
        dev, ch, DW_GDMA_LL_CHANNEL_EVENT_DMA_TFR_DONE, true);
    }
  else
    {
      ret = dsi_gdma_install_done_isr();
      if (ret < 0)
        {
          heap_caps_free(lli);
          return ret;
        }
    }

  dw_gdma_ll_channel_set_link_list_head_addr(dev, ch, (uint32_t)(uintptr_t)lli);
  dw_gdma_ll_channel_set_link_list_master_port(dev, ch, DW_GDMA_LL_MASTER_PORT_MEMORY);
  g_dsi_lli = lli;
  g_dsi_gdma_armed = true;

  dw_gdma_ll_channel_enable(dev, ch, true);

  printf("dsi: gdma ch%u one-shot-lli started (fb=%p items=%lu lli=%p) shared_irq=%d\n",
         (unsigned int)ch, fb, (unsigned long)items, lli,
         (int)g_dsi_gdma_shared_irq);
  return OK;
}

static void dsi_gdma_stop(void)
{
  dw_gdma_dev_t *dev = g_dsi_dma_dev;

  dsi_gdma_uninstall_done_isr();

  if (dev != NULL)
    {
      dw_gdma_ll_channel_enable(dev, DSI_GDMA_CHANNEL, false);
      dw_gdma_ll_channel_abort(dev, DSI_GDMA_CHANNEL);
      dw_gdma_ll_channel_clear_intr(dev, DSI_GDMA_CHANNEL, 0xffffffffu);
    }

  if (g_dsi_lli != NULL)
    {
      heap_caps_free(g_dsi_lli);
      g_dsi_lli = NULL;
    }
}

/* ------------------------------------------------------------------------
 * Pattern drawing (solid color / vertical color bar), RGB565 PSRAM fb
 * ---------------------------------------------------------------------- */

#define RGB565_RED   0xF800
#define RGB565_GREEN 0x07E0
#define RGB565_BLUE  0x001F
#define RGB565_WHITE 0xFFFF
#define RGB565_BLACK 0x0000
#define RGB565_YELLOW 0xFFE0
#define RGB565_CYAN   0x07FF
#define RGB565_MAGENTA 0xF81F
#define RGB565_DARK_BLUE 0x0011
#define RGB565_PANEL_BLUE 0x021F
#define RGB565_TEAL 0x067B
#define RGB565_DARK_GREEN 0x04A0
#define RGB565_BUTTON_NORMAL 0x2124
#define RGB565_BUTTON_DISABLED 0x3186

/* 5x7 ASCII font.  The status UI deliberately stays self-contained instead
 * of adding a GUI framework to the 4 MB target image. */
static const uint8_t g_dsi_font[37][5] =
{
  {0x7e, 0x11, 0x11, 0x11, 0x7e}, {0x7f, 0x49, 0x49, 0x49, 0x36},
  {0x3e, 0x41, 0x41, 0x41, 0x22}, {0x7f, 0x41, 0x41, 0x22, 0x1c},
  {0x7f, 0x49, 0x49, 0x49, 0x41}, {0x7f, 0x09, 0x09, 0x09, 0x01},
  {0x3e, 0x41, 0x49, 0x49, 0x7a}, {0x7f, 0x08, 0x08, 0x08, 0x7f},
  {0x00, 0x41, 0x7f, 0x41, 0x00}, {0x20, 0x40, 0x41, 0x3f, 0x01},
  {0x7f, 0x08, 0x14, 0x22, 0x41}, {0x7f, 0x40, 0x40, 0x40, 0x40},
  {0x7f, 0x02, 0x0c, 0x02, 0x7f}, {0x7f, 0x04, 0x08, 0x10, 0x7f},
  {0x3e, 0x41, 0x41, 0x41, 0x3e}, {0x7f, 0x09, 0x09, 0x09, 0x06},
  {0x3e, 0x41, 0x51, 0x21, 0x5e}, {0x7f, 0x09, 0x19, 0x29, 0x46},
  {0x46, 0x49, 0x49, 0x49, 0x31}, {0x01, 0x01, 0x7f, 0x01, 0x01},
  {0x3f, 0x40, 0x40, 0x40, 0x3f}, {0x1f, 0x20, 0x40, 0x20, 0x1f},
  {0x3f, 0x40, 0x38, 0x40, 0x3f}, {0x63, 0x14, 0x08, 0x14, 0x63},
  {0x07, 0x08, 0x70, 0x08, 0x07}, {0x61, 0x51, 0x49, 0x45, 0x43},
  {0x3e, 0x51, 0x49, 0x45, 0x3e}, {0x00, 0x42, 0x7f, 0x40, 0x00},
  {0x42, 0x61, 0x51, 0x49, 0x46}, {0x21, 0x41, 0x45, 0x4b, 0x31},
  {0x18, 0x14, 0x12, 0x7f, 0x10}, {0x27, 0x45, 0x45, 0x45, 0x39},
  {0x3c, 0x4a, 0x49, 0x49, 0x30}, {0x01, 0x71, 0x09, 0x05, 0x03},
  {0x36, 0x49, 0x49, 0x49, 0x36}, {0x06, 0x49, 0x49, 0x29, 0x1e},
  {0x00, 0x00, 0x00, 0x00, 0x00},
};

static const uint8_t *dsi_font_glyph(char ch)
{
  if (ch >= 'A' && ch <= 'Z')
    {
      return g_dsi_font[ch - 'A'];
    }

  if (ch >= '0' && ch <= '9')
    {
      return g_dsi_font[26 + ch - '0'];
    }

  return g_dsi_font[36];
}

static void dsi_fill_rect(uint16_t *px, int x, int y, int width, int height,
                          uint16_t color)
{
  int row;
  int col;

  for (row = y; row < y + height && row < PANEL_V_RES; row++)
    {
      if (row < 0)
        {
          continue;
        }

      for (col = x; col < x + width && col < PANEL_H_RES; col++)
        {
          if (col >= 0)
            {
              px[row * PANEL_H_RES + col] = color;
            }
        }
    }
}

static void dsi_draw_text(uint16_t *px, int x, int y, int scale,
                          const char *text, uint16_t color)
{
  int col;
  int row;
  int sx;
  int sy;

  while (*text != '\0')
    {
      const uint8_t *glyph = dsi_font_glyph(*text++);

      for (col = 0; col < 5; col++)
        {
          for (row = 0; row < 7; row++)
            {
              if ((glyph[col] & (1u << row)) == 0)
                {
                  continue;
                }

              for (sy = 0; sy < scale; sy++)
                {
                  for (sx = 0; sx < scale; sx++)
                    {
                      int draw_x = x + col * scale + sx;
                      int draw_y = y + row * scale + sy;

                      if (draw_x >= 0 && draw_x < PANEL_H_RES &&
                          draw_y >= 0 && draw_y < PANEL_V_RES)
                        {
                          px[draw_y * PANEL_H_RES + draw_x] = color;
                        }
                    }
                }
            }
        }

      x += 6 * scale;
    }
}

static void dsi_draw_line(uint16_t *px, int x0, int y0, int x1, int y1,
                          uint16_t color)
{
  int dx = x1 >= x0 ? x1 - x0 : x0 - x1;
  int sx = x0 < x1 ? 1 : -1;
  int dy = y1 >= y0 ? y0 - y1 : y1 - y0;
  int sy = y0 < y1 ? 1 : -1;
  int error = dx + dy;

  for (;;)
    {
      dsi_fill_rect(px, x0 - 1, y0 - 1, 3, 3, color);
      if (x0 == x1 && y0 == y1)
        {
          break;
        }

      if (2 * error >= dy)
        {
          error += dy;
          x0 += sx;
        }

      if (2 * error <= dx)
        {
          error += dx;
          y0 += sy;
        }
    }
}

