Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
static void dsi_draw_touch_marker(uint16_t *px, int x, int y)
{
  dsi_fill_rect(px, x - 12, y - 1, 25, 3, RGB565_YELLOW);
  dsi_fill_rect(px, x - 1, y - 12, 3, 25, RGB565_YELLOW);
  dsi_fill_rect(px, x - 4, y - 4, 9, 9, RGB565_RED);
}

static void dsi_draw_touch_info(uint16_t *px, uint16_t x, uint16_t y,
                                unsigned int event_count)
{
  char text[28];

  snprintf(text, sizeof(text), "N%04u X%04u Y%03u", event_count % 10000,
           (unsigned int)x, (unsigned int)y);
  dsi_fill_rect(px, 740, 18, 250, 60, RGB565_TEAL);
  dsi_draw_text(px, 748, 28, 2, text, RGB565_BLACK);
}

static uint16_t dsi_darken_rgb565(uint16_t color)
{
  uint16_t red = (color >> 11) & 0x1f;
  uint16_t green = (color >> 5) & 0x3f;
  uint16_t blue = color & 0x1f;

  /* Keep the original hue while making the pressed area unmistakably deeper. */
  red /= 2;
  green /= 2;
  blue /= 2;
  return (red << 11) | (green << 5) | blue;
}

static void dsi_draw_touch_press(uint16_t *px, int x, int y)
{
  int dx;
  int dy;

  for (dy = -DSI_TOUCH_RADIUS; dy <= DSI_TOUCH_RADIUS; dy++)
    {
      int draw_y = y + dy;

      if (draw_y < 0 || draw_y >= PANEL_V_RES)
        {
          continue;
        }

      for (dx = -DSI_TOUCH_RADIUS; dx <= DSI_TOUCH_RADIUS; dx++)
        {
          int draw_x = x + dx;

          if (draw_x < 0 || draw_x >= PANEL_H_RES ||
              dx * dx + dy * dy > DSI_TOUCH_RADIUS * DSI_TOUCH_RADIUS)
            {
              continue;
            }

          px[draw_y * PANEL_H_RES + draw_x] =
            dsi_darken_rgb565(px[draw_y * PANEL_H_RES + draw_x]);
        }
    }
}

static void dsi_cache_sync_rect(FAR uint8_t *fb, int x0, int y0,
                                int x1, int y1)
{
  uintptr_t start;
  uintptr_t end;

  if (x0 < 0)
    {
      x0 = 0;
    }
  if (y0 < 0)
    {
      y0 = 0;
    }
  if (x1 >= PANEL_H_RES)
    {
      x1 = PANEL_H_RES - 1;
    }
  if (y1 >= PANEL_V_RES)
    {
      y1 = PANEL_V_RES - 1;
    }
  if (x0 > x1 || y0 > y1)
    {
      return;
    }

  start = (uintptr_t)fb + 2 * (y0 * PANEL_H_RES + x0);
  end = (uintptr_t)fb + 2 * ((y1 + 1) * PANEL_H_RES);
  start &= ~((uintptr_t)63);
  end = (end + 63) & ~((uintptr_t)63);
  esp_cache_msync((FAR void *)start, end - start,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);
}

/* Continuously refresh: DMA ISR auto-re-arms on completion.  After modifying
 * pixels in task context, just cache-sync and the next ISR cycle picks them up.
 * Only (re)start DMA when it is not already running. */
static void dsi_submit_status_ui_frame(void)
{
  if (!g_dsi_status_ui_active || g_dsi_status_ui_fb == NULL)
    {
      return;
    }

  /* Cache sync the entire framebuffer so DMA sees the latest pixels. */
  esp_cache_msync(g_dsi_status_ui_fb,
                  PANEL_H_RES * PANEL_V_RES * sizeof(uint16_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M);

  /* If DMA is already running (ISR will auto re-arm), just return.
   * The next DMA completion interrupt will reload the latest content. */
  if (g_dsi_gdma_armed)
    {
      return;
    }

  /* If DMA was stopped (first start or recovery), restart it. */
  dsi_gdma_start(g_dsi_status_ui_fb,
                 PANEL_H_RES * PANEL_V_RES * sizeof(uint16_t));
}

static void dsi_touch_backup_region(uint16_t *px, int x, int y)
{
  int row;

  g_dsi_touch_x0 = x - DSI_TOUCH_RADIUS;
  g_dsi_touch_y0 = y - DSI_TOUCH_RADIUS;
  if (g_dsi_touch_x0 < 0)
    {
      g_dsi_touch_x0 = 0;
    }
  if (g_dsi_touch_y0 < 0)
    {
      g_dsi_touch_y0 = 0;
    }

  g_dsi_touch_width = DSI_TOUCH_DIAMETER;
  g_dsi_touch_height = DSI_TOUCH_DIAMETER;
  if (g_dsi_touch_x0 + g_dsi_touch_width > PANEL_H_RES)
    {
      g_dsi_touch_width = PANEL_H_RES - g_dsi_touch_x0;
    }
  if (g_dsi_touch_y0 + g_dsi_touch_height > PANEL_V_RES)
    {
      g_dsi_touch_height = PANEL_V_RES - g_dsi_touch_y0;
    }

  for (row = 0; row < g_dsi_touch_height; row++)
    {
      memcpy(&g_dsi_touch_backup[row * DSI_TOUCH_DIAMETER],
             &px[(g_dsi_touch_y0 + row) * PANEL_H_RES + g_dsi_touch_x0],
             g_dsi_touch_width * sizeof(uint16_t));
    }
}

static void dsi_touch_restore_region(uint16_t *px)
{
  int row;

  for (row = 0; row < g_dsi_touch_height; row++)
    {
      memcpy(&px[(g_dsi_touch_y0 + row) * PANEL_H_RES + g_dsi_touch_x0],
             &g_dsi_touch_backup[row * DSI_TOUCH_DIAMETER],
             g_dsi_touch_width * sizeof(uint16_t));
    }
}

static const char *dsi_workflow_stage_name(int stage);

static void dsi_draw_inference_result(uint16_t *px, int defect_count,
                                      int energy_level)
{
  char count_text[20];
  char energy_text[24];

  dsi_fill_rect(px, 48, 278, PANEL_H_RES - 96, 182, RGB565_PANEL_BLUE);
  if (g_dsi_workflow_blocked)
    {
      dsi_draw_text(px, 84, 306, 5, "LABEL REQUIRED", RGB565_YELLOW);
      dsi_draw_text(px, 84, 372, 3, "RUN LABEL BEFORE DEFECT CHECK", RGB565_WHITE);
    }
  else if (defect_count < 0 && g_dsi_workflow_stage > 0)
    {
      dsi_draw_text(px, 84, 306, 4, "ACTIVE STEP", RGB565_WHITE);
      dsi_draw_text(px, 84, 364, 5,
                    dsi_workflow_stage_name(g_dsi_workflow_stage),
                    RGB565_CYAN);
    }
  else if (defect_count < 0)
    {
      dsi_draw_text(px, 84, 306, 3, "CAMERA NOT STARTED", RGB565_WHITE);
      dsi_draw_text(px, 84, 350, 3, "DSI UI ONLINE", RGB565_CYAN);
      dsi_draw_text(px, 84, 394, 3, "RUN LABEL INSPECTION DEMO", RGB565_WHITE);
    }
  else if (defect_count == 0)
    {
      dsi_draw_text(px, 84, 306, 3, "INFERENCE COMPLETE", RGB565_WHITE);
      dsi_draw_text(px, 84, 350, 3, "NO DEFECT CANDIDATE", RGB565_GREEN);
      dsi_draw_text(px, 84, 394, 3, "RESULT AWAITS VALIDATION", RGB565_CYAN);
    }
  else
    {
      snprintf(count_text, sizeof(count_text), "DEFECTS %d", defect_count);
      dsi_draw_text(px, 84, 306, 3, "INFERENCE COMPLETE", RGB565_WHITE);
      dsi_draw_text(px, 84, 350, 3, "DEFECT CANDIDATES", RGB565_YELLOW);
      dsi_draw_text(px, 84, 394, 3, count_text, RGB565_YELLOW);
    }

  if (energy_level >= 1 && energy_level <= 5)
    {
      snprintf(energy_text, sizeof(energy_text), "ENERGY LEVEL: %d", energy_level);
      dsi_draw_text(px, 84, 430, 3, energy_text, RGB565_GREEN);
    }
  else
    {
      dsi_draw_text(px, 84, 430, 3, "ENERGY LEVEL: --", RGB565_CYAN);
    }
}

