Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
static const char *dsi_workflow_stage_name(int stage)
{
  static const char *const names[] =
  {
    "READY", "CAPTURE", "GALLERY", "LABEL", "ENERGY",
    "STAIN", "DAMAGE", "WRINKLE", "POSITION"
  };

  return stage >= 0 && stage <= 8 ? names[stage] : names[0];
}

static void dsi_draw_workflow_button(uint16_t *px, int x, int y,
                                     const char *label, int stage,
                                     bool enabled)
{
  const bool selected = g_dsi_workflow_stage == stage;

  dsi_fill_rect(px, x, y, 214, 46, selected ? RGB565_CYAN :
                (enabled ? RGB565_BUTTON_NORMAL : RGB565_BUTTON_DISABLED));
  dsi_draw_text(px, x + 18, y + 14, 3, label,
                selected ? RGB565_BLACK :
                (enabled ? RGB565_WHITE : RGB565_CYAN));
}

static void dsi_draw_workflow_controls(uint16_t *px)
{
  const bool enabled = g_dsi_label_detected;

  dsi_draw_workflow_button(px, 48, 478, "CAPTURE", 1, true);
  dsi_draw_workflow_button(px, 286, 478, "GALLERY", 2, true);
  dsi_draw_workflow_button(px, 524, 478, "LABEL", 3, true);
  dsi_draw_workflow_button(px, 762, 478, "ENERGY", 4, enabled);
  dsi_draw_workflow_button(px, 48, 532, "STAIN", 5, enabled);
  dsi_draw_workflow_button(px, 286, 532, "DAMAGE", 6, enabled);
  dsi_draw_workflow_button(px, 524, 532, "WRINKLE", 7, enabled);
  dsi_draw_workflow_button(px, 762, 532, "POSITION", 8, enabled);
}

/* Redraw only the workflow area (stage name, inference result, buttons) after
 * a stage change, without tearing down and restarting the DSI display. */
static void dsi_redraw_workflow_area(void)
{
  uint16_t *px;

  if (!g_dsi_status_ui_active || g_dsi_status_ui_fb == NULL)
    {
      return;
    }

  px = (uint16_t *)g_dsi_status_ui_fb;

  /* Redraw stage name bar */
  dsi_fill_rect(px, 358, 196, 500, 42, RGB565_BUTTON_NORMAL);
  dsi_draw_text(px, 358, 196, 4,
                g_dsi_workflow_blocked ? "RUN LABEL FIRST" :
                dsi_workflow_stage_name(g_dsi_workflow_stage), RGB565_WHITE);

  /* Redraw inference result area */
  dsi_draw_inference_result(px, g_dsi_inference_result_count,
                            g_dsi_inference_energy_level);

  /* Redraw buttons with new selection state */
  dsi_draw_workflow_controls(px);
}

static void dsi_draw_status_ui(FAR uint8_t *fb)
{
  uint16_t *px = (uint16_t *)fb;

  dsi_fill_rect(px, 0, 0, PANEL_H_RES, PANEL_V_RES, RGB565_DARK_BLUE);
  dsi_fill_rect(px, 0, 0, PANEL_H_RES, 92, RGB565_TEAL);
  dsi_draw_text(px, 48, 23, 7, "OPENVELA", RGB565_BLACK);
  dsi_draw_text(px, 48, 61, 3, "ESP32-P4 / CAMERA INSPECTION", RGB565_BLACK);

  dsi_fill_rect(px, 48, 128, PANEL_H_RES - 96, 120, RGB565_PANEL_BLUE);
  dsi_draw_text(px, 84, 148, 4, "WORKFLOW", RGB565_WHITE);
  dsi_fill_rect(px, 84, 188, PANEL_H_RES - 168, 42, RGB565_BUTTON_NORMAL);
  dsi_draw_text(px, 108, 196, 3, "SELECTED", RGB565_CYAN);
  dsi_draw_text(px, 358, 196, 4,
                g_dsi_workflow_blocked ? "RUN LABEL FIRST" :
                dsi_workflow_stage_name(g_dsi_workflow_stage), RGB565_WHITE);

  dsi_draw_inference_result(px, g_dsi_inference_result_count,
                            g_dsi_inference_energy_level);
  dsi_draw_workflow_controls(px);

  printf("dsi: minimal status UI drawn (%dx%d RGB565)\n",
         PANEL_H_RES, PANEL_V_RES);
}

static void dsi_draw_pattern(FAR uint8_t *fb, int mode)
{
  uint16_t *px = (uint16_t *)fb;
  int x, y;

  if (mode == 0)
    {
      /* Solid red */
      for (y = 0; y < PANEL_V_RES; y++)
        {
          for (x = 0; x < PANEL_H_RES; x++)
            {
              px[y * PANEL_H_RES + x] = RGB565_RED;
            }
        }
    }
  else if (mode == 1)
    {
      /* Solid green */
      for (y = 0; y < PANEL_V_RES; y++)
        {
          for (x = 0; x < PANEL_H_RES; x++)
            {
              px[y * PANEL_H_RES + x] = RGB565_GREEN;
            }
        }
    }
  else if (mode == 4)
    {
      dsi_draw_status_ui(fb);
    }
  else
    {
      /* Vertical 8-color bar */
      static const uint16_t bar[8] =
        {
          RGB565_WHITE, RGB565_YELLOW, RGB565_CYAN, RGB565_GREEN,
          RGB565_MAGENTA, RGB565_RED, RGB565_BLUE, RGB565_BLACK,
        };
      int b;

      for (y = 0; y < PANEL_V_RES; y++)
        {
          for (x = 0; x < PANEL_H_RES; x++)
            {
              b = (x * 8) / PANEL_H_RES;
              px[y * PANEL_H_RES + x] = bar[b];
            }
        }
    }

  printf("dsi: pattern mode=%d drawn (%dx%d RGB565)\n",
         mode, PANEL_H_RES, PANEL_V_RES);
}

/* ------------------------------------------------------------------------
 * Public: --dsi-pattern entry
 * ---------------------------------------------------------------------- */

int esp32p4_dsi_pattern_diag(int mode, uint32_t hold_ms)
{
  FAR uint8_t *fb;
  size_t fb_bytes;
  bool host_pattern;
  bool persistent_ui;
  int ret;

  if (g_dsi_status_ui_active)
    {
      return mode == 4 ? OK : -EBUSY;
    }

  if (mode < 0 || mode > 4)
    {
      mode = 2;
    }

  host_pattern = mode == 3;
  persistent_ui = mode == 4 && hold_ms == UINT32_MAX;

  if (!persistent_ui && hold_ms == 0)
    {
      hold_ms = 5000;
    }

  fb_bytes = PANEL_H_RES * PANEL_V_RES * PANEL_BPP / 8;

  /* MIPI PHY LDO (chan 3, 2.5 V) - shared with CSI PHY */
  {
    esp_ldo_channel_config_t ldo_cfg;

    memset(&ldo_cfg, 0, sizeof(ldo_cfg));
    ldo_cfg.chan_id    = 3;
    ldo_cfg.voltage_mv = 2500;
    ret = esp_ldo_acquire_channel(&ldo_cfg, &g_dsi_ldo);
    if (ret != OK)
      {
        printf("dsi: LDO acquire failed: %d\n", ret);
        return -EIO;
      }

    g_dsi_ldo_acquired = true;
  }

  fb = NULL;

  /* Mode 3 follows the official panel-start lifecycle before it switches
   * from bridge output to the Host pattern generator. */
    {
      fb = (FAR uint8_t *)heap_caps_aligned_alloc(
          64, fb_bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_DMA);
      if (fb == NULL)
        {
          printf("dsi: fb alloc failed (%lu B)\n", (unsigned long)fb_bytes);
          ret = -ENOMEM;
          goto ldo_err;
        }

      printf("dsi: fb=%p bytes=%lu\n", fb, (unsigned long)fb_bytes);
    }

  /* Bus init + panel init */
  ret = dsi_bus_init();
  if (ret != OK)
    {
      printf("dsi: bus init failed: %d\n", ret);
      goto fb_err;
    }

