Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
  dsi_dpi_config();

  /* A previous host-pattern diagnostic can survive a soft application reset.
   * Normal UI mode must explicitly select framebuffer pixels. */
  if (!host_pattern)
    {
      mipi_dsi_host_ll_dpi_set_pattern_type(s_dsi_hal.host,
                                            MIPI_DSI_PATTERN_NONE);
    }

  dsi_board_panel_reset();
  dsi_panel_io_config();
  dsi_panel_send_init_cmds();
  dsi_board_backlight_enable();

  if (host_pattern)
    {
      memset(fb, 0, fb_bytes);
    }
  else
    {
      dsi_draw_pattern(fb, mode);
    }

  esp_cache_msync(fb, fb_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  g_dsi_dma_dev = DW_GDMA_LL_GET_HW(0);
  ret = dsi_gdma_start(fb, fb_bytes);
  if (ret != OK)
    {
      printf("dsi: gdma start failed: %d\n", ret);
      goto fb_err;
    }

  /* Mirror dpi_panel_init(): video and bridge output precede set_pattern. */
  mipi_dsi_host_ll_enable_video_mode(s_dsi_hal.host, true);
  mipi_dsi_brg_ll_enable_dpi_output(s_dsi_hal.bridge, true);
  mipi_dsi_brg_ll_update_dpi_config(s_dsi_hal.bridge);
  mipi_dsi_brg_ll_enable_interrupt(s_dsi_hal.bridge,
                                   MIPI_DSI_BRG_LL_EVENT_UNDERRUN, true);
  if (host_pattern)
    {
      printf("dsi: host vertical-bar generator selected\n");
      mipi_dsi_brg_ll_enable_dpi_output(s_dsi_hal.bridge, false);
      mipi_dsi_brg_ll_update_dpi_config(s_dsi_hal.bridge);
      mipi_dsi_host_ll_dpi_set_pattern_type(
          s_dsi_hal.host, MIPI_DSI_PATTERN_BAR_VERTICAL);
    }
  dsi_host_phy_dump("start");

  printf("dsi: panel refresh started, holding %lu ms...\n",
         (unsigned long)hold_ms);

  /* L1.8.25f black-screen diagnosis (read-only): sample the data path right
   * after start and again before teardown. */
  {
    uint32_t gdma_tr0 =
      dw_gdma_ll_channel_get_trans_amount(g_dsi_dma_dev, DSI_GDMA_CHANNEL);
    uint32_t gdma_intr0 =
      dw_gdma_ll_channel_get_intr_status(g_dsi_dma_dev, DSI_GDMA_CHANNEL);
    uint32_t fifo0 = mipi_dsi_brg_ll_get_fifo_depth(s_dsi_hal.bridge);
    uint32_t fifo_stat = s_dsi_hal.bridge->fifo_flow_status.val;

    printf("dsi: diag@t0 gdma_tr=%lu gdma_intr=0x%08lx fifo_depth=%lu "
           "fifo_stat=0x%08lx\n",
           (unsigned long)gdma_tr0, (unsigned long)gdma_intr0,
           (unsigned long)fifo0, (unsigned long)fifo_stat);
    dsi_gdma_dump_lli();
  }

  if (persistent_ui)
    {
      g_dsi_status_ui_fb = fb;
      g_dsi_status_ui_active = true;
      printf("dsi: persistent status UI active\n");
      return OK;
    }

  up_mdelay(hold_ms);
  dsi_host_phy_dump("end");

  /* L1.8.25f black-screen diagnosis: second sample before teardown. */
  {
    uint32_t gdma_tr1 =
      dw_gdma_ll_channel_get_trans_amount(g_dsi_dma_dev, DSI_GDMA_CHANNEL);
    uint32_t gdma_intr1 =
      dw_gdma_ll_channel_get_intr_status(g_dsi_dma_dev, DSI_GDMA_CHANNEL);
    uint32_t fifo1 = mipi_dsi_brg_ll_get_fifo_depth(s_dsi_hal.bridge);
    uint32_t fifo_stat1 = s_dsi_hal.bridge->fifo_flow_status.val;

    printf("dsi: diag@t1 gdma_tr=%lu gdma_intr=0x%08lx fifo_depth=%lu "
           "fifo_stat=0x%08lx\n",
           (unsigned long)gdma_tr1, (unsigned long)gdma_intr1,
           (unsigned long)fifo1, (unsigned long)fifo_stat1);
  }

  /* Teardown */
  if (host_pattern)
    {
      mipi_dsi_host_ll_dpi_set_pattern_type(s_dsi_hal.host,
                                             MIPI_DSI_PATTERN_NONE);
    }

  mipi_dsi_brg_ll_enable_dpi_output(s_dsi_hal.bridge, false);
  mipi_dsi_brg_ll_update_dpi_config(s_dsi_hal.bridge);
  mipi_dsi_host_ll_enable_video_mode(s_dsi_hal.host, false);
  dsi_gdma_stop();

  printf("dsi: diag done\n");

  if (fb != NULL)
    {
      heap_caps_free(fb);
    }
  if (g_dsi_ldo_acquired)
    {
      esp_ldo_release_channel(g_dsi_ldo);
      g_dsi_ldo_acquired = false;
    }

  return OK;

fb_err:
  if (fb != NULL)
    {
      heap_caps_free(fb);
    }

ldo_err:
  if (g_dsi_ldo_acquired)
    {
      esp_ldo_release_channel(g_dsi_ldo);
      g_dsi_ldo_acquired = false;
    }

  return ret;
}

int esp32p4_dsi_status_ui_diag(uint32_t hold_ms)
{
  return esp32p4_dsi_pattern_diag(4, hold_ms);
}

int esp32p4_dsi_status_ui_start(void)
{
  return esp32p4_dsi_pattern_diag(4, UINT32_MAX);
}

bool esp32p4_dsi_status_ui_is_active(void)
{
  return g_dsi_status_ui_active;
}

int esp32p4_dsi_status_ui_set_inference_result(int candidate_count)
{
  return esp32p4_dsi_status_ui_set_inspection_result(candidate_count, -1);
}

int esp32p4_dsi_status_ui_set_inspection_result(int candidate_count,
                                                int energy_level)
{
  uint16_t *px;

  if (candidate_count < 0)
    {
      return -EINVAL;
    }

  g_dsi_inference_result_count = candidate_count;
  g_dsi_inference_energy_level = energy_level;
  if (!g_dsi_status_ui_active || g_dsi_status_ui_fb == NULL)
    {
      return OK;
    }

  /* The press renderer restores a saved region on release. Do not redraw
   * beneath an active press or it would restore stale pixels afterwards. */
  if (g_dsi_touch_has_point)
    {
      return -EBUSY;
    }

  px = (uint16_t *)g_dsi_status_ui_fb;
  dsi_draw_inference_result(px, candidate_count, energy_level);
  dsi_cache_sync_rect(g_dsi_status_ui_fb, 48, 278,
                      PANEL_H_RES - 49, 459);
  printf("dsi: inspection result candidates=%d energy_level=%d\n",
         candidate_count, energy_level);
  return OK;
}

int esp32p4_dsi_status_ui_set_label_detected(bool detected)
{
  if (g_dsi_label_detected == detected)
    return OK;

  g_dsi_label_detected = detected;
  if (!g_dsi_status_ui_active || g_dsi_status_ui_fb == NULL ||
      g_dsi_touch_has_point)
    return OK;

  dsi_draw_workflow_controls((uint16_t *)g_dsi_status_ui_fb);
  dsi_cache_sync_rect(g_dsi_status_ui_fb, 48, 478,
                      PANEL_H_RES - 49, 577);
  printf("dsi: workflow label_detected=%d\n", detected);
  return OK;
}

int esp32p4_dsi_status_ui_touch_feedback(uint16_t x, uint16_t y,
                                         unsigned int event_count,
                                         bool clear_trail)
{
  uint16_t *px;
  (void)event_count;
  (void)clear_trail;

  if (!g_dsi_status_ui_active || g_dsi_status_ui_fb == NULL)
    {
      return -ENODEV;
    }

  if (x >= PANEL_H_RES || y >= PANEL_V_RES)
    {
      return -EINVAL;
    }

  px = (uint16_t *)g_dsi_status_ui_fb;
  if (g_dsi_touch_has_point && g_dsi_touch_x == x && g_dsi_touch_y == y)
    {
      return OK;
    }

  if (g_dsi_touch_has_point)
    {
      dsi_touch_restore_region(px);
      dsi_cache_sync_rect(g_dsi_status_ui_fb, g_dsi_touch_x0,
                          g_dsi_touch_y0,
                          g_dsi_touch_x0 + g_dsi_touch_width - 1,
                          g_dsi_touch_y0 + g_dsi_touch_height - 1);
    }

  dsi_touch_backup_region(px, x, y);
  dsi_draw_touch_press(px, x, y);
  dsi_cache_sync_rect(g_dsi_status_ui_fb, g_dsi_touch_x0, g_dsi_touch_y0,
                      g_dsi_touch_x0 + g_dsi_touch_width - 1,
                      g_dsi_touch_y0 + g_dsi_touch_height - 1);
  dsi_submit_status_ui_frame();
  g_dsi_touch_has_point = true;
  g_dsi_touch_x = x;
  g_dsi_touch_y = y;
  printf("dsi: touch press x=%u y=%u\n",
         (unsigned int)x, (unsigned int)y);
  return OK;
}

void esp32p4_dsi_status_ui_touch_release(void)
{
  uint16_t *px;

