Max-YxY/contest2026_235_shushudui/app/camera_diag/esp32p4_dsi.c
  if (!g_dsi_status_ui_active || g_dsi_status_ui_fb == NULL ||
      !g_dsi_touch_has_point)
    {
      return;
    }

  px = (uint16_t *)g_dsi_status_ui_fb;
  dsi_touch_restore_region(px);
  dsi_cache_sync_rect(g_dsi_status_ui_fb, g_dsi_touch_x0, g_dsi_touch_y0,
                      g_dsi_touch_x0 + g_dsi_touch_width - 1,
                      g_dsi_touch_y0 + g_dsi_touch_height - 1);
  dsi_submit_status_ui_frame();
  g_dsi_touch_has_point = false;
  if (g_dsi_touch_y >= 478 && g_dsi_touch_y < 578)
    {
      int column = (g_dsi_touch_x - 48) / 238;
      int stage = (g_dsi_touch_y >= 532 ? 4 : 0) + column + 1;
      if (column >= 0 && column < 4)
        {
          if (stage > 3 && !g_dsi_label_detected)
            {
              g_dsi_workflow_blocked = true;
              printf("dsi: workflow stage=%d blocked: label required\n",
                     stage);
            }
          else
            {
              g_dsi_workflow_blocked = false;
              g_dsi_workflow_stage = stage;
              printf("dsi: workflow stage=%d\n", stage);
              if (g_dsi_workflow_cb)
                {
                  g_dsi_workflow_cb(stage);
                }
}

          /* Redraw the workflow area (buttons, stage name, inference)
           * in-place and submit via cache sync. No stop/start cycle. */
          dsi_redraw_workflow_area();
          dsi_submit_status_ui_frame();
        }
    }
  printf("dsi: touch release restored UI\n");
}

void esp32p4_dsi_status_ui_stop(void)
{
  if (!g_dsi_status_ui_active)
    {
      return;
    }

  mipi_dsi_brg_ll_enable_dpi_output(s_dsi_hal.bridge, false);
  mipi_dsi_brg_ll_update_dpi_config(s_dsi_hal.bridge);
  mipi_dsi_host_ll_enable_video_mode(s_dsi_hal.host, false);
  dsi_gdma_stop();
  heap_caps_free(g_dsi_status_ui_fb);
  g_dsi_status_ui_fb = NULL;
  g_dsi_status_ui_active = false;
  g_dsi_touch_has_point = false;

  if (g_dsi_ldo_acquired)
    {
      esp_ldo_release_channel(g_dsi_ldo);
      g_dsi_ldo_acquired = false;
    }

  printf("dsi: persistent status UI stopped\n");
}

static int dsi_rgb565_session_start(FAR uint8_t *frame, size_t frame_bytes,
                                    bool shared_gdma_irq)
{
  const size_t expected_bytes = PANEL_H_RES * PANEL_V_RES * PANEL_BPP / 8;
  int ret;

  if (frame == NULL || frame_bytes != expected_bytes)
    {
      return -EINVAL;
    }

  {
    esp_ldo_channel_config_t ldo_cfg;

    memset(&ldo_cfg, 0, sizeof(ldo_cfg));
    ldo_cfg.chan_id = 3;
    ldo_cfg.voltage_mv = 2500;
    ret = esp_ldo_acquire_channel(&ldo_cfg, &g_dsi_ldo);
    if (ret != OK)
      {
        return -EIO;
      }

    g_dsi_ldo_acquired = true;
  }

  dsi_board_gpio_prepare();
  ret = dsi_bus_init();
  if (ret != OK)
    {
      goto ldo_err;
    }

  dsi_dpi_config();
  dsi_board_panel_reset();
  dsi_panel_io_config();
  dsi_panel_send_init_cmds();
  dsi_board_backlight_enable();

  esp_cache_msync(frame, frame_bytes, ESP_CACHE_MSYNC_FLAG_DIR_C2M);
  g_dsi_dma_dev = DW_GDMA_LL_GET_HW(0);

  /* CSI has already initialized the shared controller for live preview.
   * Do not reset it here, or channel 0 would lose its capture state. */
  if (shared_gdma_irq)
    {
      g_dsi_gdma_controller_init = true;
    }

  g_dsi_gdma_shared_irq = shared_gdma_irq;

  ret = dsi_gdma_start(frame, frame_bytes);
  if (ret != OK)
    {
      goto ldo_err;
    }

  mipi_dsi_host_ll_enable_video_mode(s_dsi_hal.host, true);
  mipi_dsi_brg_ll_enable_dpi_output(s_dsi_hal.bridge, true);
  mipi_dsi_brg_ll_update_dpi_config(s_dsi_hal.bridge);

  return OK;

ldo_err:
  if (g_dsi_ldo_acquired)
    {
      esp_ldo_release_channel(g_dsi_ldo);
      g_dsi_ldo_acquired = false;
    }

  return ret;
}

static void dsi_rgb565_session_stop(void)
{

  mipi_dsi_brg_ll_enable_dpi_output(s_dsi_hal.bridge, false);
  mipi_dsi_brg_ll_update_dpi_config(s_dsi_hal.bridge);
  mipi_dsi_host_ll_enable_video_mode(s_dsi_hal.host, false);
  dsi_gdma_stop();
  g_dsi_gdma_shared_irq = false;

  if (g_dsi_ldo_acquired)
    {
      esp_ldo_release_channel(g_dsi_ldo);
      g_dsi_ldo_acquired = false;
    }
}

int esp32p4_dsi_show_rgb565(FAR uint8_t *frame, size_t frame_bytes,
                             uint32_t hold_ms)
{
  int ret;

  if (hold_ms == 0)
    {
      hold_ms = 5000;
    }

  ret = dsi_rgb565_session_start(frame, frame_bytes, false);
  if (ret != OK)
    {
      return ret;
    }

  printf("dsi: RGB565 frame preview holding %lu ms\n",
         (unsigned long)hold_ms);
  up_mdelay(hold_ms);
  dsi_rgb565_session_stop();

  return OK;
}

int esp32p4_dsi_live_start(FAR uint8_t *frame, size_t frame_bytes)
{
  return dsi_rgb565_session_start(frame, frame_bytes, true);
}

void esp32p4_dsi_live_stop(void)
{
  dsi_rgb565_session_stop();
}

void esp32p4_dsi_set_workflow_callback(esp32p4_dsi_workflow_cb_t cb)
{
  g_dsi_workflow_cb = cb;
}